---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSheetViewportInfo
source: html/20991b37-cdf3-f4ce-dc1a-c7d47ed00190.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSheetViewportInfo Property

"Viewport"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSheetViewportInfo { get; }
```